xxx/app/Controllers/Front.php

	public function index()
	{
		// $pager = \Config\Services::pager();
		$request = service('request');
		$searchData = $request->getGet();

		$search = "";
		if (isset($searchData) && isset($searchData['search'])) {
			$search = $searchData['search'];
		}

		// Get data
		$postinganModel = new PostinganModel();

		if ($search == '') {
			$paginateData = $postinganModel->paginate(2);
---
SELECT *
FROM `tb_postingan`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `tb_postingan`

	public function blogdetail($id)
	{
		// $id = '';
		// $request = service('request');
		// $idData = $request->getGet();
		// if (isset($idData)) {
		// 	$id = $idData['id'];
		// }

		// echo $id;
		$postinganModel = new PostinganModel();


		if ($id == "") {
			$datapostingan = '';
		} else {
			$datapostingan = $postinganModel->select('*')
				->where('id', $id)->get()->getResult();
---
SELECT *
FROM `tb_postingan`
WHERE `id` = 'assets'