app/Controllers/Front.php

	public function index()
	{
		// $pager = \Config\Services::pager();
		$request = service('request');
		$searchData = $request->getGet();

		$search = "";
		if (isset($searchData) && isset($searchData['search'])) {
			$search = $searchData['search'];
		}

		// Get data
		$postinganModel = new PostinganModel();

		if ($search == '') {
			$paginateData = $postinganModel->orderBy('tgl_posting', 'desc')->paginate(2);
---
SELECT COUNT(*) AS `numrows`
FROM `tb_postingan`